---
type: ConduitType
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 2
tags: [revit-api, class]
---

# ConduitType

`Autodesk.Revit.DB.Electrical.ConduitType` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | IsWithFitting | — | `public bool IsWithFitting { get ; }` |
| Property | Parameter | — | `` |